#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
data.aws_iam_policy_document.assume_role_policy: Reading...
aws_ecs_cluster.ecs_cluster: Refreshing state... [id=arn:aws:ecs:eu-west-2:071148681943:cluster/ecs_cluster]
data.aws_ecr_repository.tessian-demo-ramg: Reading...
aws_vpc.my_vpc: Refreshing state... [id=vpc-0408fd85322ef8820]
data.aws_iam_policy_document.assume_role_policy: Read complete after 0s [id=320642683]
aws_iam_role.testecsTaskExecutionRole: Refreshing state... [id=testecsTaskExecutionRole]
aws_iam_role_policy_attachment.ecsTaskExecutionRole_policy: Refreshing state... [id=testecsTaskExecutionRole-20230807185900577600000001]
data.aws_ecr_repository.tessian-demo-ramg: Read complete after 0s [id=tessian-demo-ramg]
aws_ecs_task_definition.task_definition: Refreshing state... [id=task]
aws_internet_gateway.gw: Refreshing state... [id=igw-0d84d1c4cc2e94d54]
aws_subnet.pub-subnet1: Refreshing state... [id=subnet-03a85786c7ba1bfbd]
aws_subnet.pub-subnet2: Refreshing state... [id=subnet-0439bc9d37ee91611]
aws_security_group.ecs_sg: Refreshing state... [id=sg-010b31a39c5c3bb09]
aws_route_table.main-route-table: Refreshing state... [id=rtb-0c9d4d82e5eabba72]
aws_route_table_association.public1_association: Refreshing state... [id=rtbassoc-046a8914939c8ee38]
aws_route_table_association.public2_association: Refreshing state... [id=rtbassoc-02108a44e69dba4ec]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_lb.test-lb will be created
  + resource "aws_lb" "test-lb" {
      + arn                        = (known after apply)
      + arn_suffix                 = (known after apply)
      + desync_mitigation_mode     = "defensive"
      + dns_name                   = (known after apply)
      + drop_invalid_header_fields = false
      + enable_deletion_protection = false
      + enable_http2               = true
      + enable_waf_fail_open       = false
      + id                         = (known after apply)
      + idle_timeout               = 60
      + internal                   = false
      + ip_address_type            = (known after apply)
      + load_balancer_type         = "application"
      + name                       = "test-lb"
      + security_groups            = [
          + "sg-010b31a39c5c3bb09",
        ]
      + subnets                    = [
          + "subnet-03a85786c7ba1bfbd",
          + "subnet-0439bc9d37ee91611",
        ]
      + tags_all                   = (known after apply)
      + vpc_id                     = (known after apply)
      + zone_id                    = (known after apply)

      + subnet_mapping {
          + allocation_id        = (known after apply)
          + ipv6_address         = (known after apply)
          + outpost_id           = (known after apply)
          + private_ipv4_address = (known after apply)
          + subnet_id            = (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pushed by: @ramg777, Action: `pull_request`*